<?php
function normalize(String $tx){
	return preg_replace("/[\n\t\r\s+]/", " ", trim(strtr(strtolower($tx), [
		'Š'=>'S', 'š'=>'s'
		, 'Ž'=>'Z', 'ž'=>'z'
		, 'À'=>'A', 'Á'=>'A', 'Â'=>'A', 'Ã'=>'A', 'Ä'=>'A', 'Å'=>'A', 'Æ'=>'A'
		, 'Ç'=>'C'
		, 'È'=>'E', 'É'=>'E', 'Ê'=>'E', 'Ë'=>'E'
		, 'Ì'=>'I', 'Í'=>'I', 'Î'=>'I', 'Ï'=>'I'
		, 'Ñ'=>'N'
		, 'Ò'=>'O', 'Ó'=>'O', 'Ô'=>'O', 'Õ'=>'O', 'Ö'=>'O', 'Ø'=>'O'
		, 'Ù'=>'U', 'Ú'=>'U', 'Û'=>'U', 'Ü'=>'U'
		, 'Ý'=>'Y'
		, 'Þ'=>'B'
		, 'ß'=>'Ss'
		, 'à'=>'a', 'á'=>'a', 'â'=>'a', 'ã'=>'a', 'ä'=>'a', 'å'=>'a', 'æ'=>'a'
		, 'ç'=>'c'
		, 'è'=>'e', 'é'=>'e', 'ê'=>'e', 'ë'=>'e'
		, 'ì'=>'i', 'í'=>'i', 'î'=>'i', 'ï'=>'i'
		, 'ð'=>'o'
		, 'ñ'=>'n'
		, 'ò'=>'o', 'ó'=>'o', 'ô'=>'o', 'õ'=>'o', 'ö'=>'o', 'ø'=>'o'
		, 'ù'=>'u', 'ú'=>'u', 'û'=>'u'
		, 'ý'=>'y'
		, 'þ'=>'b'
		, 'ÿ'=>'y'
		, '"'=>''
		, '\''=>''
		, '`'=>''
		, '`'=>''
		, '\n'=>' '
		, '\t'=>' '
		, '\r'=>' '
		, '-'=>' '
		, 'ª'=>' '
		, 'º'=>' '
	])));
}

function barload($cur = 1, $ref = 100, $len = 10, $char = "="){
	$num = ceil($len * ($cur / $ref));
	$arr = "";
	for($i=0; $i++<$num;) $arr .= $char;
	if($num<$len) $arr .= ">"; else $arr .= $char;
	for($i=0; $i++<$len-$num;) $arr .= " ";
	return "[ ". $arr . " ] " . floor($cur/$ref*100) . "% ";
}
